{
  "backend/main.mo": "Defines an empty Motoko actor, serving as a placeholder backend canister with no exposed methods.",
  "feature_evidence.json": "Machine-generated report mapping implemented frontend features to files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend files, likely used for documentation or planning.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles, light/dark theme color tokens, and shared UI variables.",
  "frontend/index.html": "HTML entry point that mounts the React app and sets basic metadata and page title.",
  "frontend/src/App.tsx": "Root React component controlling the step-by-step flow between landing, quiz, game intro, tapping game, and final message.",
  "frontend/src/components/FloatingTapFeedback.tsx": "Renders animated floating feedback text at tap coordinates during the tapping game.",
  "frontend/src/components/HeartButton.tsx": "Reusable heart-styled button component with gradient colors and animated hover/active states.",
  "frontend/src/components/PetalOverlay.tsx": "Displays an animated overlay of falling cherry blossom petals for visual flair during gameplay.",
  "frontend/src/components/YesNoButtons.tsx": "Provides styled Yes and No buttons for answering quiz questions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication state, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are required for this application.",
  "frontend/src/hooks/useTappingGame.ts": "Custom hook managing the tapping mini-game logic, including timer, tap count, success, and failure states.",
  "frontend/src/index.css": "Sets up Tailwind base/components/utilities, defines CSS variables for light and dark themes, global typography/background styles, and custom keyframes and animation utility classes.",
  "frontend/src/lib/utils.ts": "Provides a cn() utility that merges conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wrapping it with React Query and Internet Identity providers and importing global styles.",
  "frontend/src/steps/FinalMessageStep.tsx": "A React step component that reveals a heartfelt anniversary message after a button click, with animated hearts and themed styling.",
  "frontend/src/steps/GameIntroStep.tsx": "Introduces a tapping mini-game with an animated character and instructions, transitioning to game start on user interaction.",
  "frontend/src/steps/LandingStep.tsx": "Landing screen displaying a title, couple image, introductory message, and a heart button to proceed to the next step.",
  "frontend/src/steps/QuizStep.tsx": "Implements a multi-question yes/no quiz with progress tracking, playful responses, and completion callback.",
  "frontend/src/steps/TappingGameStep.tsx": "Interactive tapping game step that tracks taps and time, shows visual feedback and animations, and displays success or failure results.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom theme colors via CSS variables, typography, animations, and plugins.",
  "project_state.json": "Defines the overall project vision and state for a romantic multi-step single-page website, including schema/version metadata and a high-level summary of the experience. Lists detailed existing feature specifications covering the landing page, yes/no quiz, chibi dino mini-game, tapping game mechanics, and final anniversary reveal."
}